In [4]:
import numpy as np
import pandas as pd

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.172887 -0.948737  1.248442
1 -1.778686  0.646248 -1.293992
2 -1.551618 -0.617233  0.053168
3  0.586665 -3.084872  0.001529
4  1.293078  0.366127 -1.320859
5  0.730171 -0.718232 -0.985016
6 -0.837659  0.775938 -0.135839

In [17]:
df.iloc[:4, 1] = NA

In [18]:
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0  0.172887       NaN       NaN
1 -1.778686       NaN       NaN
2 -1.551618       NaN  0.053168
3  0.586665       NaN  0.001529
4  1.293078  0.366127 -1.320859
5  0.730171 -0.718232 -0.985016
6 -0.837659  0.775938 -0.135839

In [20]:
df.dropna()

          0         1         2
4  1.293078  0.366127 -1.320859
5  0.730171 -0.718232 -0.985016
6 -0.837659  0.775938 -0.135839

In [21]:
df.dropna(thresh=2)

          0         1         2
2 -1.551618       NaN  0.053168
3  0.586665       NaN  0.001529
4  1.293078  0.366127 -1.320859
5  0.730171 -0.718232 -0.985016
6 -0.837659  0.775938 -0.135839

In [22]:
df.fillna(0)

          0         1         2
0  0.172887  0.000000  0.000000
1 -1.778686  0.000000  0.000000
2 -1.551618  0.000000  0.053168
3  0.586665  0.000000  0.001529
4  1.293078  0.366127 -1.320859
5  0.730171 -0.718232 -0.985016
6 -0.837659  0.775938 -0.135839

In [23]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.172887  0.500000  0.000000
1 -1.778686  0.500000  0.000000
2 -1.551618  0.500000  0.053168
3  0.586665  0.500000  0.001529
4  1.293078  0.366127 -1.320859
5  0.730171 -0.718232 -0.985016
6 -0.837659  0.775938 -0.135839

In [24]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.172887  0.000000  0.000000
1 -1.778686  0.000000  0.000000
2 -1.551618  0.000000  0.053168
3  0.586665  0.000000  0.001529
4  1.293078  0.366127 -1.320859
5  0.730171 -0.718232 -0.985016
6 -0.837659  0.775938 -0.135839

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -1.265895  0.940753  0.555339
1 -0.655662  1.565976 -1.323728
2 -0.595160 -0.963043  0.084947
3 -0.474753 -0.878655  1.471900
4 -0.570421  1.553720 -1.303898
5 -0.165806 -0.034659  0.503489

In [26]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [27]:
df

          0         1         2
0 -1.265895  0.940753  0.555339
1 -0.655662  1.565976 -1.323728
2 -0.595160       NaN  0.084947
3 -0.474753       NaN  1.471900
4 -0.570421       NaN       NaN
5 -0.165806       NaN       NaN

In [28]:
df.fillna(method='ffill')

          0         1         2
0 -1.265895  0.940753  0.555339
1 -0.655662  1.565976 -1.323728
2 -0.595160  1.565976  0.084947
3 -0.474753  1.565976  1.471900
4 -0.570421  1.565976  1.471900
5 -0.165806  1.565976  1.471900

In [29]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.265895  0.940753  0.555339
1 -0.655662  1.565976 -1.323728
2 -0.595160  1.565976  0.084947
3 -0.474753  1.565976  1.471900
4 -0.570421       NaN  1.471900
5 -0.165806       NaN  1.471900

In [30]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [31]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [32]:
data.duplicated()  # 检测是否为重复行

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [33]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [34]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [35]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [36]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [37]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [38]:
meat_to_animal = {
    'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [39]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [40]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [41]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [42]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [43]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [44]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [45]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [46]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [47]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                     index=['Ohio', 'Colorado', 'New York'],
                     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [48]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [49]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [50]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [51]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [52]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [53]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [54]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)

In [55]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [56]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [57]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [58]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [59]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [62]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [65]:
data = np.random.rand(20)
data

array([0.48402028, 0.52397225, 0.78213033, 0.0055871 , 0.53502448,
       0.34779859, 0.08506399, 0.12247439, 0.88824414, 0.16497793,
       0.99480951, 0.15528051, 0.0571571 , 0.8136639 , 0.25665106,
       0.78828524, 0.57892764, 0.1595907 , 0.71384993, 0.38756822])

In [66]:
pd.cut(data, 4, precision=2)

[(0.25, 0.5], (0.5, 0.75], (0.75, 0.99], (0.0046, 0.25], (0.5, 0.75], ..., (0.75, 0.99], (0.5, 0.75], (0.0046, 0.25], (0.5, 0.75], (0.25, 0.5]]
Length: 20
Categories (4, interval[float64, right]): [(0.0046, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

In [67]:
data = np.random.randn(1000)

In [68]:
cats = pd.qcut(data, 4)

In [69]:
cats

[(0.662, 3.079], (-3.092, -0.739], (0.662, 3.079], (-0.0431, 0.662], (0.662, 3.079], ..., (-3.092, -0.739], (-0.739, -0.0431], (-0.739, -0.0431], (-0.0431, 0.662], (-0.739, -0.0431]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.092, -0.739] < (-0.739, -0.0431] < (-0.0431, 0.662] < (0.662, 3.079]]

In [70]:
pd.value_counts(cats)

(-3.092, -0.739]     250
(-0.739, -0.0431]    250
(-0.0431, 0.662]     250
(0.662, 3.079]       250
Name: count, dtype: int64

In [71]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0431, 1.286], (-1.315, -0.0431], (-0.0431, 1.286], (-0.0431, 1.286], (1.286, 3.079], ..., (-1.315, -0.0431], (-1.315, -0.0431], (-1.315, -0.0431], (-0.0431, 1.286], (-1.315, -0.0431]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.092, -1.315] < (-1.315, -0.0431] < (-0.0431, 1.286] < (1.286, 3.079]]

In [73]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -0.534525 -2.010207 -1.002580 -2.073069
1    0.415631 -0.355816 -0.421895  0.200961
2    1.650743 -1.410727  0.166113  1.801227
3    0.602425  0.322846  1.703785  1.889784
4   -0.085847 -0.801143 -0.484394  0.956626
..        ...       ...       ...       ...
995 -1.036398 -2.797193 -0.478423  0.202019
996  0.939099  1.107711 -0.542182  0.060634
997 -1.440785 -0.401600  1.272221 -0.200120
998 -2.588217  0.724136  1.705347 -0.019529
999  2.645990 -0.243889 -0.543241 -0.964102

[1000 rows x 4 columns]

In [74]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.041963    -0.019180     0.026358    -0.004555
std       0.995142     0.964217     0.970707     1.033584
min      -2.944756    -3.296258    -2.690869    -3.153775
25%      -0.710604    -0.639224    -0.631812    -0.701284
50%      -0.072251    -0.011216     0.003146    -0.012022
75%       0.663789     0.616443     0.723239     0.665443
max       3.065058     2.938606     2.691377     3.633578

In [82]:
col = data[3]

In [83]:
col[np.abs(col) > 3]

62     3.022085
280    3.057310
611    3.230443
858    3.633578
981   -3.153775
Name: 3, dtype: float64

In [92]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.042028    -0.018884     0.026358    -0.005345
std       0.994941     0.963254     0.970707     1.030154
min      -2.944756    -3.000000    -2.690869    -3.000000
25%      -0.710604    -0.639224    -0.631812    -0.701284
50%      -0.072251    -0.011216     0.003146    -0.012022
75%       0.663789     0.616443     0.723239     0.665443
max       3.000000     2.938606     2.691377     3.000000

In [99]:
data[(np.abs(data) > 2).any(axis=1)]

            0         1         2         3
0   -0.534525 -2.010207 -1.002580 -2.073069
15   0.523068  1.107323  1.284394  2.433156
22   2.001464 -0.938621 -1.549164 -0.321338
28  -2.765478  0.757824  1.168717 -0.130037
32   2.095249 -0.064178 -0.430199  1.337185
..        ...       ...       ...       ...
984  0.864771 -2.493704  0.570076 -2.166033
988 -2.035413 -2.040398  0.449815 -0.278882
995 -1.036398 -2.797193 -0.478423  0.202019
998 -2.588217  0.724136  1.705347 -0.019529
999  2.645990 -0.243889 -0.543241 -0.964102

[152 rows x 4 columns]

In [100]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0 -1.0 -1.0  1.0
2  1.0 -1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4 -1.0 -1.0 -1.0  1.0

In [102]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5, 4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [103]:
sampler = np.random.permutation(5)
sampler

array([4, 2, 1, 3, 0])

In [104]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3

In [106]:
df.sample(n=3)

   0  1   2   3
2  8  9  10  11
0  0  1   2   3
1  4  5   6   7

In [107]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
3    6
0    5
0    5
2   -1
0    5
0    5
4    4
2   -1
4    4
dtype: int64

In [109]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [110]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [111]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False